In [2]:
#list of list
import pandas as pd

l1=[[11,22,33],[44,55,66],[77,88,99]]
df1=pd.DataFrame(l1)
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [3]:
#dict of list
d={
    'amzn':[300,400,500,600],
    'tsla':[122,567,897,456],
    'goog':[657,453,789,890],
}
df2=pd.DataFrame(d)
df2

   amzn  tsla  goog
0   300   122   657
1   400   567   453
2   500   897   789
3   600   456   890

In [4]:
#list of dict
d1=[{'open':100,'high':500,'low':789,'close':765},
    {'open':67,'high':789,'low':789,'close':765},
    {'open':100,'high':500,'low':789,'close':765}]
df3=pd.DataFrame(d1)
df3

   open  high  low  close
0   100   500  789    765
1    67   789  789    765
2   100   500  789    765

In [5]:
import numpy as np
np1=np.arange(25).reshape(5,5)
df4=pd.DataFrame(np1,columns=['c1','c2','c3','c4','c5'],index=['r1','r2','r3','r4','r5'])
df4

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19
r5  20  21  22  23  24

In [6]:
df5=pd.read_csv('sp500.csv')
df5

                           Name                  Sector   Price    EPS
0                     Apple Inc  Information Technology  170.12   9.20
1                    Abbvie Inc             Health Care   93.29   5.31
2           Abbott Laboratories             Health Care   55.28   2.41
3                 Accenture Plc  Information Technology  145.30   5.91
4                  Allergan Plc             Health Care  171.81  15.42
..                          ...                     ...     ...    ...
97   Verizon Communications Inc      Telecommunications   45.85   3.75
98     Walgreens Boots Alliance        Consumer Staples   70.25   5.10
99        Wells Fargo & Company              Financials   54.02   4.14
100             Wal-Mart Stores        Consumer Staples   96.08   4.36
101            Exxon Mobil Corp                  Energy   80.31   3.56

[102 rows x 4 columns]